ERP/src/InformationRegisters/КонфигурацииСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонфигурацииСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксимумСлотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/КонфигурацииСервера/Ext/ManagerModule.bsl
Процедура ДобавитьНовуюКонфигурацию(СерверСсылка, ИмяНовойКонфигурации, ЛимитСлотовНовойКонфигурации) Экспорт
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.Сервер = СерверСсылка;
	НоваяЗапись.ИмяКонфигурации = ИмяНовойКонфигурации;
	НоваяЗапись.МаксимумСлотов = ЛимитСлотовНовойКонфигурации;
	НоваяЗапись.Записать();
	
КонецПроцедуры


Функция ВсеКонфигурацииСервера(СерверСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонфигурацииСервера.ИмяКонфигурации КАК ИмяКонфигурации,
		|	КонфигурацииСервера.МаксимумСлотов КАК МаксимумСлотов
		|ИЗ
		|	РегистрСведений.КонфигурацииСервера КАК КонфигурацииСервера
		|ГДЕ
		|	КонфигурацииСервера.Сервер = &СерверСсылка";
	
	Запрос.УстановитьПараметр("СерверСсылка", СерверСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции
